refactor: using mermaid
